---
kind: method
id: M:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetFabricationPartTypeIds
source: html/6e660502-a47a-b9b3-f21b-c29d988c89c8.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetFabricationPartTypeIds Method

Returns set of fabrication part types in use in the routing solution mode.

## Syntax (C#)
```csharp
public ISet<ElementId> GetFabricationPartTypeIds()
```

## Returns
The set of ElementIds for for fabrication part types that is in use in routing solution mode.